OpenFOAM/elliot-7/Dissertation/L/simpleL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0) // 1
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
    (0 0 2) // 2
    (1 0 2)
    (1 1 2)
    (0 1 2)
    (2 0 1) // 3
    (2 1 1)
    (2 0 2)
    (2 1 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (10 10 10) simpleGrading (1 1 1)
    hex (5 12 13 6 9 14 15 10) (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet1
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (9 14 15 10)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
	    (2 3 7 6)
	    (7 6 10 11)
	    (6 13 15 10)
	    (0 1 4 5)
	    (4 5 9 8)
	    (5 12 14 9)
	    (3 0 4 7)
	    (4 7 11 8)
	    (2 1 5 6)
	    (6 13 12 5)
	    (13 12 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
